Repository: pigamux/pigamux.github.io
Catalog: games/p/Fireflies.tmx
Source language: en_us
Languages: pt_pt

source: Fireflies
pt_pt: Pirilampos

source: “Fireflies”
pt_pt: "Vagalumes"

source: Like Christmas lights gently floating in midair, fireflies always add a little bit of magic to the forests they live in.
pt_pt: Como luzes de Natal a flutuar suavemente no ar, pirilampos acrescentam sempre um pouco de magia às florestas em que vivem.

source: <g id="1">CLICK & DRAG</g> <x id="2"/> to create some <x id="3"/> firefly chaos →
pt_pt: <g id="1">CLICA E ARRASTA</g> <x id="2"/> para criar algum <x id="3"/> caos de pirilampos →

source: But some firefly species add even <g id="1">more</g> magic.
pt_pt: Mas algumas espécies de pirilampos acrescentam ainda <g id="1">mais</g> magia.

source: In Southeast Asia, if you go out to the riverbank deep in the night, you'll be treated to this stunning lightshow – courtesy of the Thailand firefly:
pt_pt: No sudeste da Ásia, se fores até à margem do rio no meio da noite, serás presenteado com este impressionante show de luzes - cortesia do pirilampo da Tailândia:

source: A whole mangrove forest, lighting up all at once, plunging into darkness, then lighting up all again – in near-perfect synchrony.
pt_pt: Um manguezal inteiro a iluminar-se de uma vez só, mergulhando na escuridão, e então iluminando tudo outra vez - numa sincronia quase perfeita.

source: How do thousands of fireflies coordinate with each other?
pt_pt: Como é que milhares de pirilampos se coordenam uns com os outros?

source: Who is the conductor of this silent symphony?
pt_pt: Quem é o maestro desta sinfonia silenciosa?

source: This was a mystery for nearly a century, and in 1992, a team of US scientists set out to solve it.
pt_pt: Isto foi um mistério por quase um século e, em 1992, uma equipa de cientistas americanos decidiu resolvê-lo.

source: Sadly, but not surprisingly, the press mocked them – <bx id="1"/>“Govt.
pt_pt: Infelizmente, mas não surpreendentemente, a imprensa gozou com eles — <bx id="1"/>“O Governo

source: Blows Your Tax $$ to Study Fireflies in Borneo: Not a Bright Idea!”<ex id="_1"/>
pt_pt: queima os nossos impostos €€ para estudar pirilampos em Bornéu: Não é uma ideia brilhante!”<ex id="_1"/>

source: read one tabloid.
pt_pt: disse uma revista.

source: Undeterred, the scientists pressed on, cameras and calculators in hand.
pt_pt: Implacáveis, os cientistas seguiram em frente, câmaras e calculadoras nas mãos.

source: So, how <g id="1">do</g> thousands of fireflies pick a leader to follow, a maestro to keep their flashing in time?
pt_pt: Então, <g id="1">como é que</g> milhares de pirilampos escolhem um líder para seguir, um maestro para manter os seus sinais luminosos em sincronia?

source: The answer, the scientists found, is simple:
pt_pt: A resposta, os cientistas descobriram, é simples:

source: They don't.
pt_pt: Eles não escolhem.

source: Each firefly has its <g id="1">own</g> individual internal clock, and every time the clock “strikes twelve”, it flashes.
pt_pt: Cada pirilampo tem o seu <g id="1">próprio</g> relógio interno individual, e sempre que o relógio “bate as doze horas”, ele pisca.

source: And instead of synchronizing their clocks to a central leader, each firefly does the following:
pt_pt: E em vez de sincronizar os seus relógios com um líder central, cada pirilampo faz o seguinte:

source: Step 1: when you see a nearby firefly flash, nudge your clock a little bit forward.
pt_pt: Etapa 1: quando vê um sinal luminoso próximo de outro pirilampo, adianta um pouco o seu relógio.

source: Step 2: that's it.
pt_pt: Etapa 2: e é isso.

source: Can such a small, short-ranged interaction really cause an entire forest-ful of fireflies to flash in synchronous harmony?
pt_pt: Será que uma interação tão pequena e de curto alcance pode realmente fazer uma floresta inteira de pirilampos piscar numa harmonia sincrónica?

source: Only one way to find out...
pt_pt: Só há uma maneira de descobrir...

source: Wait.
pt_pt: Espera.

source: Watch carefully.
pt_pt: Vê com atenção.

source: What do you see?
pt_pt: O que é que vês?

source: At first, not much.
pt_pt: No início, não muito.

source: The fireflies still seem to be flashing without pattern.
pt_pt: Os pirilampos ainda parecem estar a piscar sem um padrão.

source: But after a while, you may notice small “patches” of fireflies firing together – but these individual “patches” are still out of sync.
pt_pt: Mas, depois de um tempo, vais notar pequenos grupos de pirilampos a piscarem juntos — mas esses grupos individuais ainda estão dessincronizados.

source: After a bit longer, you start seeing fireflies performing a “wave”, like excited fans in the stands during a baseball game.
pt_pt: Depois de um pouco mais de tempo, vais começar a ver pirilampos a fazer uma "onda", como fãs empolgados nas bancadas durante um jogo de beisebol.

source: Finally, all but a few fireflies are flashing together – and eventually, even these laggards join in the collective dance.
pt_pt: Finalmente, todos, exceto alguns pirilampos, piscam juntos — e, eventualmente, até mesmo os atrasados juntam-se à dança coletiva.

source: What's more amazing?
pt_pt: Há algo mais incrível do que isso?

source: If you disrupt these fireflies by causing some chaos...
pt_pt: Se interromperes estes pirilampos causando algum caos...

source: <g id="1">CLICK & DRAG</g> <x id="2"/> to mess up these <x id="3"/> fireflies, again →
pt_pt: <g id="1">CLICA E ARRASTA</g> <x id="2"/> para confundir estes <x id="3"/> pirilampos, outra vez →

source: ...yes, it may cause them to divide for a moment, but slowly and surely, they shall collect themselves again, and flash as one.
pt_pt: ... sim, isso pode fazer com que eles se dividam por um momento, mas lenta e certamente, eles recompor-se-ão e brilharão como um.

source: Here's a few more buttons & sliders you can use, to play around with these virtual fireflies:
pt_pt: Aqui estão mais alguns botões e barras deslizantes que podes usar, para brincar com estes pirilampos virtuais:

source: And that's the secret behind our fireflies' magic trick:
pt_pt: E este é o segredo por trás do truque de magia dos nossos pirilampos:

source: <g id="1">small-scale</g><x id="2"/><g id="3">interactions</g>
pt_pt: <g id="1">interações em</g><x id="2"/><g id="3">pequena escala</g>

source: <g id="1">large-scale</g><x id="2"/><g id="3">organization</g>
pt_pt: <g id="1">organização em</g><x id="2"/><g id="3">grande escala</g>

source: As it turns out, fireflies aren't the only things that synchronize themselves from the bottom up.
pt_pt: Acontece que os pirilampos não são as únicas coisas que se sincronizam de baixo para cima.

source: Your neurons create brain waves.
pt_pt: Os teus neurónios criam ondas cerebrais.

source: Your heart's pacemaker cells fire in sync. <bx id="1"/>
pt_pt: As células do pacemaker do teu coração disparam em sincronia. <bx id="1"/>

source: Even a bunch of lifeless metronomes on a wobbly platform will start to march together.<ex id="_1"/>
pt_pt: Até mesmo um monte de metrónomos sem vida numa plataforma instável começarão a marchar juntos.<ex id="_1"/>

source: On top of all that, understanding self-synchrony has helped us build better lasers, computers, and communications technology!
pt_pt: Além de tudo isso, entender a auto-sincronia ajudou-nos a construir melhores lasers, computadores e tecnologia de comunicação!

source: And to think, the mathematics of self-synchronizing systems was discovered in part by a few scientists who just really loved fireflies.
pt_pt: E pensar que a matemática dos sistemas de auto-sincronização foi descoberta em parte por alguns cientistas que realmente amavam pirilampos.

source: Looks like calling their project <g id="1">“Not a Bright Idea”</g> was not a bright idea.
pt_pt: Parece que chamar o projeto deles de <g id="1">“Não é uma Ideia Brilhante”</g> não foi uma ideia brilhante.

source: You float along, softly, in silence, occasionally punctuating the darkness with a small dot of bright light.
pt_pt: Tu flutuas em conjunto, suavemente, em silêncio, ocasionalmente pontuando a escuridão com um pequeno ponto de luz brilhante.

source: By yourself, there's not much to see.
pt_pt: Sozinho, não há muito para ver.

source: But whenever you shine, you inspire those close to you to shine too, a little bit sooner than they otherwise would have.
pt_pt: Mas, sempre que brilhas, inspiras aqueles perto de ti a brilharem também, um pouco mais cedo do que eles brilhariam.

source: And those close to you, in turn, inspire those close to <g id="1">them</g>.
pt_pt: E aqueles perto de ti, por sua vez, inspiram aqueles perto <g id="1">deles</g>.

source: And so on, and so on.
pt_pt: E assim por diante.

source: First, a few small groups start flashing together.
pt_pt: Primeiro, alguns pequenos grupos começam a piscar juntos.

source: Then, a wave of light sweeps across the swarm.
pt_pt: Depois, uma onda de luz varre o enxame.

source: Finally, you're all dazzling together, a brilliant beacon, all in harmony, in tandem – in synchrony.
pt_pt: Finalmente, estão todos deslumbrantes juntos, um farol brilhante, todos em harmonia, em tandem — em sincronia.

source: What small-scale interaction will you make today, little firefly?
pt_pt: Que interação em pequena escala farás hoje, pequeno pirilampo?

source: Inspired by Steven Strogatz's book,<x id="1"/> <g id="2"> SYNC: How Order Emerges From Chaos In the Universe, Nature, and Daily Life </g>
pt_pt: Inspirado no livro de Steven Strogatz,<x id="1"/> <g id="2"> SYNC: How Order Emerges From Chaos In the Universe, Nature, and Daily Life </g>

source: Created by <g id="1">Nicky Case</g>, with the love & support of my patrons <g id="2">(see them all here)</g>
pt_pt: Criado por <g id="1">Nicky Case</g>, com o amor e apoio dos meus patronos <g id="2">(veja todos aqui)</g>

source: “Fireflies” is open source, dedicated to the public domain.
pt_pt: “Pirilampos” é um código aberto, dedicado ao domínio público.

source: <g id="1">(Get the code on Github!)</g>
pt_pt: <g id="1">(Obtém o código no Github!)</g>

source: <g id="1"> <g id="2">support me on patreon <3</g> </g>
pt_pt: <g id="1"> <g id="2">apoia-me no patreon <3</g> </g>

source: share with your swarm:<x id="1"/> <x id="2"/>
pt_pt: compartilha com o teu enxame:<x id="1"/> <x id="2"/>

source: fan-translations:<x id="1"/> <g id="2">中文 (chinese)</g><x id="3"/> <g id="4">português (brazilian portuguese)</g><x id="5"/> <g id="6">français (french)</g><x id="7"/> <g id="8">deutsch (german)</g><x id="9"/> <g id="10">türkçe (turkish)</g><x id="11"/> <g id="12">pусский (russian)</g><x id="13"/> <g id="14">עברית (hebrew)</g><x id="15"/> <g id="16">magyar (hungarian)</g>
pt_pt: traduções de fãs:<x id="1"/> <g id="2">中文 (chinês)</g><x id="3"/> <g id="4">português (português brasileiro)</g><x id="5"/> <g id="6">français (francês)</g><x id="7"/> <g id="8">deutsch (alemão)</g><x id="9"/> <g id="10">türkçe (turco)</g><x id="11"/> <g id="12">pусский (russo)</g><x id="13"/> <g id="14">עברית (hebraico)</g><x id="15"/> <g id="16">magiar (húngaro)</g>
